feat/major refactor
